Tekla Open API Reference for Tekla Structures 2025
PourObject.PourNumber Property
 Gets or sets the pour number of the pour.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string PourNumber { get; set; }
Public Property PourNumber As String
	Get
	Set
Property Value
Type: String
See Also
Reference
PourObject Class
Tekla.Structures.Model Namespace